<template>
  <div class="offer">
    <p>
      <strong>
        ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА)
      </strong>
      <strong>
        про надання фізкультурно – оздоровчих послуг
      </strong>
    </p>
    <p>
      Цей договір є офіційною та публічною пропозицією фізичної особи - підприємця Бухтіярової Єлизавети Дмитрівни,
      ідентифікаційний код: 3684100188, місцезнаходження: вул. Гарматна, буд. 38А, м. Київ, Україна, 03067 (надалі –
      «Виконавець») необмеженому колу осіб (надалі – «Споживачу») укласти договір про надання фізкультурно – оздоровчих
      послуг, представлених на вебсайті enjoyfitnes.com (надалі – «Договір»).
      Договір є публічним, тобто відповідно до статті 633 Цивільного кодексу України, його умови є однаковими для всіх
      Споживачів, без надання переваги одному Споживачеві перед іншим. Шляхом укладення цього Договору Споживач в
      повному обсязі приймає умови та порядок надання/отримання та здійснення розрахунків за придбані товари/послуги, а
      також інші умови Договору.
    </p>
    <p>
      <em>1. ВИЗНАЧЕННЯ ТЕРМІНІВ</em>
      <br>
      1.1. Вебсайт – офіційна вебсторінка Виконавця за електронною адресою: enjoyfitnes.com, що є одним із основних
      джерел інформування Споживача.
      <br>
      1.2. Студія – місце надання послуг, у тому числі але не виключно, фітнес студія або студії, що надають
      фізкультурно-оздоровчі послуги під брендом Enjoy Fitness Studio.
      <br>
      1.3. Публічна оферта - пропозиція Виконавця, адресована Споживачам укласти Договір на умовах, що містяться на
      Вебсайті.
      <br>
      1.4. Акцепт – повне та безумовне прийняття Споживачем умов Публічної оферти шляхом вибору опції «Записатись» або
      «Придбати абонемент» у відповідному розділі Вебсайту.
      <br>
      1.5. Продукція – будь-який товар чи послуга, що передаються/надаються Виконавцем на користь Споживача.
      <br>
      1.6. Товар – будь-який матеріальний об’єкт (виріб), що передається Виконавцем за цим Договором.
      <br>
      1.7. Послуга – діяльність Виконавця з організації та проведення фізкультурно-оздоровчих заходів за індивідуальним
      замовленням Споживача для задоволення його особистих потреб в межах вартості обраного пакету тренувань.
      <br>
      1.8. Споживач – дієздатна фізична особа, яка досягла 18 років та Акцептувала умови Публічної оферти.
      <br>
      1.9. Сторони – разом іменовані Виконавець та Споживач.
    </p>
    <p>
      <em>2. ПРЕДМЕТ ДОГОВОРУ</em>
      <br>
      2.1. Виконавець зобов’язується надати Споживачу Послуги, а Споживач зобов’язується прийняти ці Послуги та
      здійснити розрахунок на умовах цього Договору.
      <br>
      2.2. У межах надання Послуг за цим Договором Виконавець може реалізовувати Товари з метою задоволення особистих
      потреб Споживача. У такому разі Виконавець зобов’язується передати Товар у власність Споживача, а Споживач
      зобов’язується оплатити і прийняти Товар на умовах визначених цим Договором.
    </p>
    <p>
      <em>3. АКЦЕПТУВАННЯ ДОГОВОРУ</em>
      <br>
      3.1. Договір вважається укладеним з моменту Акцептування Споживачем умов Публічної оферти чи вчинення інших дій,
      що свідчать про прийняття ним Публічної оферти.
      <br>
      3.2. Додатковим свідченням укладення Договору є отримання Споживачем від Виконавця підтвердження замовлення в
      електронному вигляді.
      <br>
      3.3. За бажанням Споживача, Договір може бути оформлений у письмовій формі.
    </p>
    <p>
      <em>4. ЗАМОВЛЕННЯ ПРОДУКЦІЇ</em>
      <br>
      4.1. Споживач самостійно оформлює замовлення через форму «Кошик» у відповідному розділі Вебсайту або зробивши
      замовлення електронною поштою чи за номером телефону, вказаним в розділі «Контакти» Вебсайту.
      <br>
      4.2. Виконавець має право відмовитися від оформлення замовлення у випадку, якщо відомості, вказані Споживачем під
      час оформлення замовлення, є неповними або викликають підозру щодо їх дійсності.
      <br>
      4.3. Якщо будь-якої із Сторін договору необхідна додаткова інформація для оформлення замовлення, він має право
      запитати її в іншої Сторони. У разі ненадання необхідної інформації Споживачем, Виконавець не несе
      відповідальності за неналежне надання Товарів та Послуг.
      <br>
      4.4. Споживач несе відповідальність за достовірність наданої інформації при оформленні замовлення.
    </p>
    <p>
      <em>5. ЦІНА ПРОДУКЦІЇ</em>
      <br>
      5.1. Ціни на Товари та Послуги визначаються Виконавцем самостійно і вказані на Вебсайті у гривнях.
      <br>
      5.2 Ціни на Товари та Послуги можуть змінюватися Виконавцем в односторонньому порядку залежно від кон'юнктури
      ринку. При цьому ціна окремої одиниці Продукції, вартість якої оплачена Споживачем у повному обсязі, не може бути
      змінена.
      <br>
      5.3. Розрахунки між Виконавцем і Споживачем за Продукцію здійснюються шляхом перерахування грошей на рахунок
      Виконавця чи за допомогою платіжних систем, що використовуються Виконавцем.
    </p>
    <p>
      <em>6. ВИДИ ТОВАРІВ ТА ЇХ ДОСТАВКА</em>
      <br>
      6.1. У якості товару можуть бути представлені речі власного виробництва, придбані або створені за замовленням
      Виконавця, що реалізуються онлайн за допомогою Вебсайту або офлайн у Студії.
      <br>
      6.2. Вартість Товарів, які вказані на Вебсайті не включають у себе вартість доставки до Споживача. Вартість
      доставки сплачується Споживачем відповідно до діючих тарифів служб доставки (перевізників) безпосередньо обраній
      ним службі доставки (перевізнику).
      <br>
      6.3. При отриманні Товару Споживач повинен у присутності представника служби доставки (перевізника) перевірити
      його відповідність якісним і кількісним характеристикам (найменування, кількість, комплектність тощо).
      <br>
      6.4. Споживач або його представник під час приймання Товару підтверджує своїм підписом в товарному чеку або в
      транспортній накладній на доставку товарів, що не має претензій до кількості, зовнішнього вигляду і комплектності
      Товару.
      <br>
      6.5. Право власності та ризик випадкової втрати або пошкодження Товару переходить до Споживача або його
      представника з моменту отримання Товару Споживачем у Студії чи під час передачі Виконавцем Товару службі доставки
      (перевізнику) обраної Споживачем.
    </p>
    <p>
      <em>7. ВИДИ ПОСЛУГ ТА ПОРЯДОК ЇХ НАДАННЯ</em>
      <br>
      7.1. До послуг належать, у тому числі, але не виключно, пакети тренувань номіналом 1 (один), 8 (вісім), 12
      (дванадцять), 15 (п’ятнадцять), 20 (двадцять) тренувань.
      <br>
      7.2. Виконавець надає Послуги шляхом надання доступу до Студії на підставі абонементу, що надсилається в
      електронному варіанті протягом 1 (однієї) години після здійснення оплати за Послуги.
    </p>
    <p>
      <em>8. ОБОВ’ЯЗКИ СТОРІН</em>
      <br>
      8.1. Споживач зобов’язаний:
      <br>
      8.1.1. вчасно та у повному обсязі сплатити вартість Продукції за цим Договором;
      <br>
      8.1.2. відвідувати Студію в межах її робочого часу згідно з графіком, визначеним на Вебсайті;
      <br>
      8.1.3. відвідувати Студію лише за умови нормального стану здоров’я та самопочуття, нормальній температурі тіла,
      відсутності будь-яких симптомів респіраторних та інших захворювань;
      <br>
      8.1.4. охайно та дбайливо ставитись до обладнання та іншого інвентарю, яке знаходиться в Студії.
      <br>
      8.1.5. дотримуватись умов цього Договору.
      <br>
      8.2. Виконавець зобов’язаний:
      <br>
      8.2.1. надавати Споживачу оплачені ним Послуги відповідно до категорії обраного ним пакету тренувань.
      <br>
      8.2.2. забезпечити надання Послуг відповідної якості згідно умов цього Договору
      <br>
      8.2.3. підтримувати функціонування обладнання та інвентарю, а також допоміжних приміщень, призначеного для
      використання Споживачем.
    </p>
    <p>
      <em>9. ПОВЕРНЕННЯ ТОВАРІВ</em>
      <br>
      9.1. Споживач має право на повернення Виконавцеві непродовольчого Товару належної якості, якщо Товар не
      задовольнив його за формою, габаритами, фасоном, кольором, розміром або з інших причин не може бути ним
      використаний за призначенням. Споживач має право на повернення Товару належної якості протягом 14 (чотирнадцяти)
      днів, не враховуючи дня купівлі. Повернення Товару належної якості проводиться, якщо він не використовувався і
      якщо збережено його товарний вигляд, споживчі властивості, упаковка, пломби, ярлики, а також розрахунковий
      документ, виданий Споживачу за оплату Товару. Перелік товарів, що не підлягають поверненню на підставах,
      передбачених у цьому пункті, затверджується Кабінетом Міністрів України.
      <br>
      9.2. Повернення Товару після спливу 14 (чотирнадцяти) денного строку, визначеного п. 9.1. Договору не
      допускається.
      <br>
      9.3. Повернення Споживачеві вартості Товару належної якості здійснюється протягом 30 (тридцяти) календарних днів з
      моменту отримання такого Товару.
      <br>
      9.4. Вартість Товару підлягає поверненню шляхом банківського переказу на рахунок Споживача.
      <br>
      9.5. Повернення Товару неналежної якості за адресою Виконавця, здійснюється за рахунок Споживача та Виконавцем
      Споживачеві не відшкодовується.
    </p>
    <p>
      <em>10. ПОВЕРНЕННЯ КОШТІВ ЗА ПОСЛУГИ</em>
      <br>
      10.1. Споживач не може вимагати зниження вартості Послуг чи повернення коштів, у випадку, якщо він не скористався
      Послугами.
      <br>
      10.2. Споживач у разі порушення умов Договору користується правами визначеними статтею 10 Закону України «Про
      захист прав споживачів», зокрема має право відмовитись від Договору і вимагати відшкодувати збитків, якщо
      Виконавець своєчасно не приступив до виконання зобов'язань за Договором або за наявності істотних недоліків у
      Послузі.
    </p>
    <p>
      <em>11. ВІДПОВІДАЛЬНІСТЬ СТОРІН. ПОРЯДОК ВИРІШЕННЯ СПОРІВ</em>
      <br>
      11.1. Виконавець не несе відповідальності за досягнення чи недосягнення Споживачем спортивних результатів, яких
      він бажав досягти в результаті отримання Послуг в Студії.
      <br>
      11.2. Споживач несе матеріальну відповідальність за заподіяну Виконавцю шкоду. У разі заподіяння Виконавцеві
      збитку останнім складається Акт, який підписується уповноваженими представниками Сторін. У разі відмови Споживача
      від підписання Акту, Виконавець підписує його в односторонньому порядку з приміткою про відмову Споживача від
      підпису. Споживач протягом 5 (п’яти) календарних днів на підставі Акту зобов’язаний відшкодувати заподіяну шкоду у
      повному обсязі.
      <br>
      11.3. Виконавець не несе відповідальності за будь-які негативні наслідки, що можуть мати місце у випадку, якщо
      Споживач має протипоказання щодо отримання Послуг за станом свого здоров’я. Споживач самостійно визначає
      можливість за станом здоров’я користуватися Послугами. Виконавець не несе відповідальності за шкоду, пов’язану з
      погіршенням здоров’я Споживача, якщо воно погіршилося в результаті захворювання, травми або іншого розладу
      здоров’я спричиненого відвідуванням Студії.
      <br>
      11.4. Виконавець не несе відповідальності за технічні незручності, спричинені проведенням сезонних, профілактичних
      або аварійних робіт комунальними службами.
      <br>
      11.5. Виконавець не несе відповідальність перед Споживачем за дії/бездіяльність третіх осіб, які не є його
      працівниками.
      <br>
      11.6. Виконавець не несе відповідальності за невиконання, прострочення виконання або інше неналежне виконання
      зобов'язання та недоліки у наданих послугах, що виникли з вини самого Споживача чи внаслідок дії непереборної
      сили.
      <br>
      11.7. Спірні питання, що виникають між Сторонами у зв’язку з виконанням цього Договору, вирішуються шляхом
      переговорів на принципах поваги до інтересів один одного або, у разі неможливості вирішення, відповідними судовими
      органами.
    </p>
    <p>
      <em>12. СТРОК ДІЇ ДОГОВОРУ</em>
      <br>
      12.1. Договір є публічним і безстроковим та діє до його припинення будь-якою зі Сторін у порядку, встановленому
      цим Договором або чинним законодавством.
      <br>
      12.2. Якщо Споживач своєю поведінкою систематично порушує права і законні інтереси інших відвідувачів Студії або
      працівників Виконавця, перешкоджає нормальному здійсненню діяльності Студії, ігнорує законні вимоги працівників
      Виконавця, порушує приписи лікарів і режим лікування, пов’язаний з обмеженнями у фізичних навантаженнях, а також у
      разі наявності простроченої заборгованості з оплати Послуг, Виконавець має право розірвати Договір в
      односторонньому порядку шляхом письмового повідомлення Споживача не пізніше ніж за 10 (десять) календарних днів до
      дати розірвання.
      <br>
      12.3. Споживач має право розірвати Договір протягом 14 (чотирнадцяти) днів з моменту його укладення.
      <br>
      12.4. У випадку одностороннього розірвання Договору, Споживач має право на повернення коштів сплачених за
      Продукцію.
      <br>
      12.5. Сплачені Споживачем кошти за цим Договором повертаються Виконавцем за письмовою заявою Споживача. Відповідна
      письмова заява розглядається Виконавцем протягом 30 (тридцяти) календарних днів з дати звернення Споживача.
      <br>
      12.6. Вартість оплачених Послуг за цим Договором повертається Споживачу в розмірі 50 (п`ятдесяти) % від здійснених
      платежів за Договором за тренування, які ще не були проведенні. Вартість одного тренування розраховується шляхом
      ділення суми фактично сплачених Споживачем коштів за Договором на кількість всіх тренувань у придбаному пакеті.
    </p>
    <p>
      <em>13. ПРИВАТНІСТЬ</em>
      <br>
      13.1. Виконавець поважає право Споживача на приватність та прагне зробити все можливе для захисту отриманих
      персональних даних.
      <br>
      13.2. Споживач несе відповідальність за підтримання своїх персональних даних в актуальному стані.
      <br>
      13.3. При оформленні замовлення на Вебсайті Споживач надає наступну інформацію, необхідну Виконавцю для надання
      Товарів та Послуг:
      <br>
      13.3.1. прізвище та ім'я Споживача;
      <br>
      13.3.2. адреса, за якою слід доставити Товар (у разі доставки до адреси Споживача);
      <br>
      13.3.3. контактний телефон;
      <br>
      13.3.4. ідентифікаційний код для юридичної особи або фізичної особи-підприємця.
      <br>
      13.4 Володарем персональних даних є Бухтіярова Єлизавета Дмитрівна.
      <br>
      13.5. Обробка персональних даних здійснюється з метою передачі придбаних Товарів/Послуг та виконання обов’язків,
      що виникають із Договору. Правовою підставою обробки персональних даних є виконання правочину.
      <br>
      13.6. Вебсайт містить посилання на сторонні ресурси або послуги третіх осіб. Зобов’язання Виконавця щодо
      приватності не розповсюджується на такі сторонні вебсайти та компанії.
      <br>
      13.7. Персональні дані Споживача за замовчуванням зберігаються в Україні, але Виконавець залишає за собою
      можливість їх обробки в іншій країні, за умови застосування відповідних заходів захисту та у межах визначених
      метою обробки.
      <br>
      13.8. Виконавець передає персональні дані Споживача своїм партнерам за допомогою яких Виконавець надає Товари та
      Послуги. Передача даних відбувається в межах та обсязі, необхідному для досягнення визначеної мети обробки
      персональних даних.
      <br>
      13.9. Від імені Виконавця обробляють персональні дані:
      <br>
      13.9.1. Товариство з обмеженою відповідальністю «Фінансова компанія «ПОРТМОНЕ» – забезпечують
      організацію і здійснення переказів грошових коштів.
      <br>
      13.10. У випадках, визначених законодавством, Виконавець може розкривати персональні дані Споживача у тому обсязі
      в якому це необхідно за запитом органів державної влади та суду.
      <br>
      13.11. Оформлюючи замовлення Споживач підтверджує, що уважно ознайомився з правами визначеними статтею 8 Закону
      України «Про захист персональних даних».
    </p>
    <p>
      <em>14. ІНШІ УМОВИ</em>
      <br>
      14.1. Цей договір укладено на території України і діє відповідно до чинного законодавства України
      <br>
      14.2. Споживач, прийнявши умови Публічної оферти, підтверджує, що до укладання Договору уважно ознайомився з його
      умовами, йому зрозумілі всі істотні умови, щодо яких Сторони мали намір досягти згоди та юридичні значення всіх
      термінів цього Договору.
      <br>
      14.3. Виконавець має право вносити зміни до цього Договору в односторонньому порядку. Крім того, зміни до Договору
      також можуть бути внесені за взаємною згодою Сторін в порядку, передбаченому чинним законодавством України.
    </p>
    <p>
      <em>15. АДРЕСА ТА РЕКВІЗИТИ ВИКОНАВЦЯ:</em>
      Фізична особа-підприємець Бухтіярова Єлизавета Дмитрівна
      <br>
      Місцезнаходження: вул. Гарматна, буд. 38А, м. Київ, Україна, 03067
      <br>
      IBAN: UA533220010000026006330135718
      <br>
      в АТ «УНІВЕРСАЛ БАНК»
      <br>
      МФО 322001
      <br>
      ОКПО Банку 21133352
      <br>
      ІПН 3684100188
      <br>
      Тел.: + 38 (073) 730 45 09
    </p>
  </div>
</template>

<script>
export default {
  name: "PublicOffer"
}
</script>

<style scoped>
.offer{
  display: flex;
  flex-direction: column;
  padding: 2rem;
}
.offer p{
  margin-bottom: 2rem;
  padding: 0 2rem;
}
.offer p:first-child{
  padding: 0;
  text-align: center;
}
.offer p em{
  display: block;
  text-align: center;
}
</style>