<template>
  <div class="terms">
    <h1>{{ $t('termsOfServiceUse') }}</h1>
    <ul>
      <li>
        <p>1. Реєстрація і абонементи:</p>
        <ul>
          <li>
            - Клієнт повинен зареєструватись на сайті фітнес студії, особисто у студії або у телефонному режимі із
            контакт-менеджером.
          </li>
          <li>
            - Для участі в тренуваннях необхідно придбати абонемент.
          </li>
          <li>
            - Тривалість, вартість та умови абонементів можуть варіюватись і визначаються фітнес студією, будь-які зміни
            вартості у абонементах не впливають на абонементи, придбані до набуття чинності цих змін.
          </li>
        </ul>
      </li>
      <li>
        <p>2. Вікові обмеження:</p>
        <ul>
          <li>
            - Учасникам, які не досягли повноліття, потрібна письмова згода батьків або опікуна для участі в
            тренуваннях.
          </li>
        </ul>
      </li>
      <li>
        <p>
          3. Здоров'я та медичні обмеження:
        </p>
        <ul>
          <li>
            - Клієнти повинні бути впевнені у своєму здоров'ї та придатності до фізичних навантажень.

          </li>
          <li>
            - У разі наявності медичних обмежень або хронічних захворювань, клієнти повинні проконсультуватись з лікарем
            перед
            початком тренувань.
          </li>
        </ul>
      </li>
      <li>
        <p>
          4. Правила поведінки:
        </p>
        <ul>
          <li>
            - Клієнти зобов'язані дотримуватись правил і вказівок інструкторів та персоналу студії.
          </li>
          <li>
            - Заборонено здійснювати будь-які небезпечні або недоречні дії, які можуть загрожувати безпеці інших
            учасників.
          </li>
        </ul>
      </li>
      <li>
        <p>
          5. Відмова від відповідальності:
        </p>
        <ul>
          <li>
            - Фітнес студія не несе відповідальності за будь-які травми або збитки, які можуть виникнути під час
            тренувань.
          </li>
          <li>
            - Клієнти повинні самостійно страхувати своє майно, залишене без нагляду у студії.
          </li>
        </ul>
      </li>
      <li>
        <p>
          6. Скасування та перенесення тренувань:
        </p>
        <ul>
          <li>
            - Клієнти повинні вчасно скасовувати або переносити тренування у випадку неможливості прийти.
          </li>
          <li>
            - Правила щодо скасування абонементів можуть бути визначені фітнес студією.
          </li>
          <li>
            - Скасування або перенесення тренувань відбувається не менш ніж за 3 години до початку тренування.
          </li>
        </ul>
      </li>
      <li>
        <p>
          7. Конфіденційність:
        </p>
        <ul>
          <li>
            - Фітнес студія зобов'язується зберігати конфіденційність особистих даних клієнтів та не передавати їх
            третім особам
            без згоди клієнтів.
          </li>
        </ul>
      </li>
    </ul>


  </div>
</template>

<script>
export default {
  name: "TermsOfServiceUse"
}
</script>

<style scoped>
.terms{
  padding: 1rem;
}
li{
  padding: .5rem;
}
</style>